Revit 2027 API
RebarUpdateCurvesData.GetEndConstraint Method
 Gets the current constraint for the end handle of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraint GetEndConstraint()
Public Function GetEndConstraint As RebarConstraint
public:
RebarConstraint^ GetEndConstraint()
member GetEndConstraint : unit -> RebarConstraint
Return Value
RebarConstraint
 Returns the current constraint for the end handle of the Rebar. Return value is null is no constraint is present.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace